import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-patients',
  templateUrl: './patients.component.html',
  styleUrls: ['./patients.component.css']
})

export class PatientsComponent implements OnInit {

  patientCount: number;
  patientName: string[];
  patientAge: number[];
  patientAdress: string[];
  patientCondition: string[];
  clickedPatient: number;

  constructor() {
    this.patientCount = 18;
    this.clickedPatient = -1;
    this.patientName = ['Ангел Бобев Чочев', 'Ангел Петров Грозданов',
    'Антон Симеонов Касабов', 'Анета Иванова Иванова', 'Борис Петков Иванов', 'Борислава Танева Илиева',
    'Ангел Бобев Чочев','Ангел Петров Грозданов',
    'Антон Симеонов Касабов', 'Анета Иванова Иванова', 'Борис Петков Иванов', 'Борислава Танева Илиева',
    'Ангел Бобев Чочев','Ангел Петров Грозданов',
    'Антон Симеонов Касабов', 'Анета Иванова Иванова', 'Борис Петков Иванов', 'Борислава Танева Илиева'];
    this.patientAge = [67, 42, 32, 44, 57, 67, 67, 42, 32, 44, 57, 67, 67, 42, 32, 44, 57, 67];
    this.patientAdress = ['гр. Варна', 'гр. Варна', 'гр. Варна', 'гр. Бургас', 'гр. Бургас', 'гр. Варна', 
    'гр. Варна', 'гр. Варна', 'гр. Варна', 'гр. Бургас', 'гр. Бургас', 'гр. Варна',
    'гр. Варна', 'гр. Варна', 'гр. Варна', 'гр. Бургас', 'гр. Бургас', 'гр. Варна'];
    this.patientCondition = ['Бъбречна недостатъчност', 'Диабет', 'Хашимото', 'Астма', 'Сърдечна недостатъчност', 'Диабет',
    'Сърдечна недостатъчност', 'Онкоболен', 'Адисонова болест', 'Астма', 'Левкемия', 'Бъбречна недостатъчност',
    'Диабет', 'Ендометриоза', 'Хашимото', 'Астма', 'Диабет', 'Остеопороза'];
  }

  ngOnInit() {
  }

}



